XingTunAI/xiaozhi-esp32/main/audio/audio_service.cc
const std::string& AudioService::GetLastWakeWord() const {
    static const std::string empty;
    return audio_engine_ ? audio_engine_->GetLastDetectedWakeWord() : empty;
}

std::unique_ptr<AudioStreamPacket> AudioService::PopWakeWordPacket() {
    auto packet = std::make_unique<AudioStreamPacket>();
    if (audio_engine_ && audio_engine_->GetWakeWordOpus(packet->payload)) {
        return packet;
    }
    return nullptr;
}

void AudioService::EnableWakeWordDetection(bool enable) {
    ESP_LOGD(TAG, "%s wake word detection", enable ? "Enabling" : "Disabling");
    if (enable) {
        if (!InitializeAudioEngine()) {
            xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
            return;
        }
#if !(CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32S31)
        auto* lite_engine = static_cast<LiteAudioEngine*>(audio_engine_.get());
        if (!lite_engine->RestoreWakeWordResources()) {
            xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
            return;
        }
#endif
        if (!audio_engine_->HasWakeWord()) {
            xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
            return;
        }
        {
            std::lock_guard<std::mutex> lock(input_resampler_mutex_);
            if (input_resampler_ != nullptr) {
                esp_ae_rate_cvt_reset(input_resampler_);
            }
        }
        audio_engine_->EnableWakeWordDetection(true);
        xEventGroupSetBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
    } else {
        if (audio_engine_initialized_) {
            audio_engine_->EnableWakeWordDetection(false);
        }
        xEventGroupClearBits(event_group_, AS_EVENT_WAKE_WORD_RUNNING);
    }
}

void AudioService::ReleaseWakeWordResources() {
#if !(CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32S31)
    if (!audio_engine_initialized_) {
        return;
    }
    if (xEventGroupGetBits(event_group_) &
        (AS_EVENT_WAKE_WORD_RUNNING | AS_EVENT_AUDIO_PROCESSOR_RUNNING)) {
        ESP_LOGW(TAG, "Cannot release WakeNet while the audio engine is active");
        return;
    }
    static_cast<LiteAudioEngine*>(audio_engine_.get())->ReleaseWakeWordResources();
#endif
}

void AudioService::EnableVoiceProcessing(bool enable) {
    ESP_LOGD(TAG, "%s voice processing", enable ? "Enabling" : "Disabling");

    if (enable) {
        if (!InitializeAudioEngine()) {
            return;
        }
        ResetDecoder();
        audio_input_need_warmup_ = true;
        {
            std::lock_guard<std::mutex> lock(input_resampler_mutex_);
            if (input_resampler_ != nullptr) {
                esp_ae_rate_cvt_reset(input_resampler_);
            }
        }
        audio_engine_->EnableVoiceProcessing(true);
        xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_PROCESSOR_RUNNING);
    } else {
        if (audio_engine_initialized_) {
            audio_engine_->EnableVoiceProcessing(false);
        }
        xEventGroupClearBits(event_group_, AS_EVENT_AUDIO_PROCESSOR_RUNNING);
    }
}

void AudioService::EnableAudioTesting(bool enable) {
    ESP_LOGI(TAG, "%s audio testing", enable ? "Enabling" : "Disabling");
    if (enable) {
        xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING);
    } else {
        xEventGroupClearBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING);
        /* Copy audio_testing_queue_ to audio_decode_queue_ */
        std::lock_guard<std::mutex> lock(audio_queue_mutex_);
        audio_decode_queue_ = std::move(audio_testing_queue_);
        if (!audio_decode_queue_.empty()) {
            playback_drained_notified_ = false;
        }
        audio_queue_cv_.notify_all();
    }
}

void AudioService::EnableExternalCapture(bool enable) {
    ESP_LOGI(TAG, "%s external audio capture", enable ? "Enabling" : "Disabling");
    std::lock_guard<std::mutex> lock(external_capture_mutex_);
    if (enable) {
        if (!external_capture_enabled_) {
            // A caller must complete the stop barrier before starting another
            // recording. Never route the old callback into a new capture epoch.
            if (external_capture_in_flight_) {
                ESP_LOGW(TAG, "External capture start rejected while previous frame is draining");
                return;
            }
            ++external_capture_generation_;
            external_capture_enabled_ = true;
        }
        xEventGroupClearBits(event_group_, AS_EVENT_AUDIO_TESTING_RUNNING |
                                               AS_EVENT_WAKE_WORD_RUNNING |
                                               AS_EVENT_AUDIO_PROCESSOR_RUNNING);
        xEventGroupSetBits(event_group_, AS_EVENT_EXTERNAL_CAPTURE_RUNNING);
    } else {
        external_capture_enabled_ = false;
        xEventGroupClearBits(event_group_, AS_EVENT_EXTERNAL_CAPTURE_RUNNING);
        // The input task owns hardware stop; wake it even with no active consumer.
        xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_INPUT_STOP_REQUEST);
    }
}

bool AudioService::StopExternalCaptureAndWait(uint32_t timeout_ms) {
    std::unique_lock<std::mutex> lock(external_capture_mutex_);
    external_capture_enabled_ = false;
    xEventGroupClearBits(event_group_, AS_EVENT_EXTERNAL_CAPTURE_RUNNING);
    xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_INPUT_STOP_REQUEST);
    const uint64_t generation = external_capture_generation_;

    if (xTaskGetCurrentTaskHandle() == audio_input_task_handle_) {
        // In particular, an external PCM callback cannot wait for itself.
        return !external_capture_in_flight_;
    }

    bool drained = external_capture_cv_.wait_for(
        lock, std::chrono::milliseconds(timeout_ms), [this, generation]() {
            return !external_capture_in_flight_ || external_capture_generation_ != generation;
        });
    return drained && !external_capture_in_flight_ && !external_capture_enabled_ &&
           external_capture_generation_ == generation;
}

void AudioService::EnableDeviceAec(bool enable) {
    ESP_LOGI(TAG, "%s device AEC", enable ? "Enabling" : "Disabling");
    device_aec_enabled_ = enable;

